<a href="https://colab.research.google.com/github/rahiakela/data-science-research-and-practice/blob/main/pandas-in-action/chapter_01_introducing_pandas/chapter_01_introducing_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## A Tour of Pandas

The best way to grasp the power of pandas is to see it in action. Let’s take a quick tour
of the library by analyzing a data set of the 700 highest-grossing movies of all time. I
hope you are pleasantly surprised by how intuitive the syntax of pandas can be, even if
you are new to programming.

## Importing a Data Set

In [1]:
import pandas as pd

In [2]:
!wget -q https://github.com/paskhaver/pandas-in-action/raw/master/chapter_01_introducing_pandas/movies.csv

Our data is stored in a single movies.csv file. A CSV (comma-separated values) file
is a plain-text file that separates each row of data with a line break and each row value
with a comma. The first row in the file holds the column headers for the data.

In [3]:
pd.read_csv("movies.csv")

     Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]

Pandas imports the CSV file’s contents into an object called a DataFrame. Think of an object as a container for storing data.

Pandas uses one type of
object (the DataFrame) to store multicolumn data sets and another type of object
(the Series) to store single-column data sets.

Let’s swap the autogenerated numeric index with the values from the Title column.

In [4]:
pd.read_csv("movies.csv", index_col = "Title")

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

In [46]:
movies = pd.read_csv("movies.csv", index_col = "Title")

## Manipulating a DataFrame

In [6]:
# We can extract a few rows from the beginning:
movies.head(4)

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015

In [7]:
# Or we can peek at the end of the data set instead
movies.tail(6)

                          Rank           Studio     Gross  Year
Title
21 Jump Street             777             Sony  $201.60   2012
Yogi Bear                  778  Warner Brothers  $201.60   2010
Garfield: The Movie        779              Fox  $200.80   2004
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

In [8]:
# We can find out how many rows the DataFrame has
len(movies)

782

In [9]:
# We can ask pandas for the number of rows and columns in the DataFrame.
movies.shape

(782, 4)

In [10]:
# We can inquire about the total number of cells
print(782 * 4)
movies.size

3128

3128

In [11]:
# We can ask for the data types of the four columns
movies.dtypes

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

In [12]:
# pull out the 500th movie in the data set
movies.iloc[499]

Rank           500
Studio         Fox
Gross     $288.30
Year          2018
Name: Maze Runner: The Death Cure, dtype: object

Pandas returns a new object here called a Series, a one-dimensional labeled array of
values. Think of it as a single column of data with an identifier for each row. 

Notice that the Series’ index labels (Rank, Studio, Gross, and Year) are the four columns
from the movies DataFrame. Pandas has altered the presentation of the original
row’s values.

In [13]:
# extracts a row by its index label rather than its numeric position
movies.loc["Forrest Gump"]

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object

In [14]:
# Index labels can contain duplicates.
movies.loc["101 Dalmatians"]

                Rank       Studio     Gross  Year
Title
101 Dalmatians   425  Buena Vista  $320.70   1996
101 Dalmatians   708  Buena Vista  $215.90   1961

In [15]:
# to see the five movies with the most recent release date
movies.sort_values(by = "Year", ascending = False).head()

                                            Rank  ...  Year
Title                                             ...
Avengers: Endgame                              1  ...  2019
John Wick: Chapter 3 - Parabellum            458  ...  2019
The Wandering Earth                          114  ...  2019
Toy Story 4                                  198  ...  2019
How to Train Your Dragon: The Hidden World   199  ...  2019

[5 rows x 4 columns]

In [16]:
# sort movies first by the Studio column’s values and then by the Year column’s values
movies.sort_values(by = ["Studio", "Year"]).head()

                         Rank       Studio     Gross  Year
Title
The Blair Witch Project   588      Artisan  $248.60   1999
101 Dalmatians            708  Buena Vista  $215.90   1961
The Jungle Book           755  Buena Vista  $205.80   1967
Who Framed Roger Rabbit   410  Buena Vista  $329.80   1988
Dead Poets Society        636  Buena Vista  $235.90   1989

In [17]:
# We can also sort the index, which is helpful if we want to see the movies in alphabetical order
movies.sort_index().head()

                  Rank           Studio     Gross  Year
Title
10,000 B.C.        536  Warner Brothers  $269.80   2008
101 Dalmatians     708      Buena Vista  $215.90   1961
101 Dalmatians     425      Buena Vista  $320.70   1996
2 Fast 2 Furious   632        Universal  $236.40   2003
2012                93             Sony  $769.70   2009

## Counting Values in a Series

Let’s try a more sophisticated analysis. What if we wanted to find out which movie studio
had the greatest number of highest-grossing films? To solve this problem, we’ll
need to count the number of times each studio appears in the Studio column.

We can extract a single column of data from a DataFrame as a Series. Notice
that pandas preserves the DataFrame’s index, the movie titles, in the Series:

In [18]:
movies["Studio"]

Title
Avengers: Endgame                   Buena Vista
Avatar                                      Fox
Titanic                               Paramount
Star Wars: The Force Awakens        Buena Vista
Avengers: Infinity War              Buena Vista
                                     ...
Yogi Bear                       Warner Brothers
Garfield: The Movie                         Fox
Cats & Dogs                     Warner Brothers
The Hunt for Red October              Paramount
Valkyrie                                    MGM
Name: Studio, Length: 782, dtype: object

Now that we’ve isolated the Studio column, we can count each unique value’s
number of occurrences.

In [19]:
movies["Studio"].value_counts().head(10)

Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Paramount           76
Dreamworks          27
Lionsgate           21
New Line            16
MGM                 11
Name: Studio, dtype: int64

## Filtering a Column by One or More Criteria

You’ll often want to extract a subset of rows based on one or more criteria.

What if we wanted to find only the films released by Universal Studios?

In [20]:
movies[movies["Studio"] == "Universal"]

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

In [21]:
movies["Studio"].head()

Title
Avengers: Endgame               Buena Vista
Avatar                                  Fox
Titanic                           Paramount
Star Wars: The Force Awakens    Buena Vista
Avengers: Infinity War          Buena Vista
Name: Studio, dtype: object

In [22]:
movies[movies["Studio"] == "Buena Vista"]

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018
Marvel's The Avengers            7  Buena Vista  $1,518.80   2012
Avengers: Age of Ultron          9  Buena Vista  $1,405.40   2015
...                            ...          ...         ...   ...
Tomorrowland                   745  Buena Vista    $209.20   2015
The Jungle Book                755  Buena Vista    $205.80   1967
King Arthur                    765  Buena Vista    $203.60   2004
Need for Speed                 769  Buena Vista    $203.30   2014
Ponyo                          771  Buena Vista    $202.40   2009

[125 rows x 4 columns]

We can assign the filtering condition to a variable to provide context for readers:

In [23]:
released_by_universal = (movies["Studio"] == "Universal")
movies[released_by_universal].head()

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015

In [24]:
released_by_buena_vista = (movies["Studio"] == "Buena Vista")
movies[released_by_buena_vista].head()

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018
Marvel's The Avengers            7  Buena Vista  $1,518.80   2012
Avengers: Age of Ultron          9  Buena Vista  $1,405.40   2015

We can also filter DataFrame rows by multiple criteria. The next example targets all movies released by Universal Studios and released in 2015:

In [25]:
released_by_universal = movies["Studio"] == "Universal"
released_in_2015 = movies["Year"] == 2015
movies[released_by_universal & released_in_2015]

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

In [26]:
released_by_buena_vista = movies["Studio"] == "Buena Vista"
released_in_2015 = movies["Year"] == 2015
movies[released_by_buena_vista & released_in_2015]

                              Rank       Studio       Gross  Year
Title
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Age of Ultron          9  Buena Vista  $1,405.40   2015
Inside Out                      69  Buena Vista    $857.60   2015
Cinderella                     180  Buena Vista    $543.50   2015
Ant-Man                        200  Buena Vista    $519.30   2015
The Good Dinosaur              405  Buena Vista    $332.20   2015
Tomorrowland                   745  Buena Vista    $209.20   2015

We can also filter for films that fit either condition: released by Universal or released in 2015.

In [27]:
released_by_universal = movies["Studio"] == "Universal"
released_in_2015 = movies["Year"] == 2015
movies[released_by_universal | released_in_2015]

                                Rank       Studio       Gross  Year
Title
Star Wars: The Force Awakens       4  Buena Vista  $2,068.20   2015
Jurassic World                     6    Universal  $1,671.70   2015
Furious 7                          8    Universal  $1,516.00   2015
Avengers: Age of Ultron            9  Buena Vista  $1,405.40   2015
Jurassic World: Fallen Kingdom    13    Universal  $1,309.50   2018
...                              ...          ...         ...   ...
The Break-Up                     763    Universal    $205.00   2006
Everest                          766    Universal    $203.40   2015
Patch Adams                      772    Universal    $202.30   1998
Kindergarten Cop                 775    Universal    $202.00   1990
Straight Outta Compton           776    Universal    $201.60   2015

[140 rows x 4 columns]

In [28]:
released_by_buena_vista = movies["Studio"] == "Buena Vista"
released_in_2015 = movies["Year"] == 2015
movies[released_by_buena_vista | released_in_2015]

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018
Jurassic World                   6    Universal  $1,671.70   2015
Marvel's The Avengers            7  Buena Vista  $1,518.80   2012
...                            ...          ...         ...   ...
King Arthur                    765  Buena Vista    $203.60   2004
Everest                        766    Universal    $203.40   2015
Need for Speed                 769  Buena Vista    $203.30   2014
Ponyo                          771  Buena Vista    $202.40   2009
Straight Outta Compton         776    Universal    $201.60   2015

[157 rows x 4 columns]

Pandas provides additional ways to filter a DataFrame. We can target column values less than or greater than a specific value.

In [29]:
before_1975 = movies["Year"] < 1975
movies[before_1975]

                    Rank           Studio     Gross  Year
Title
The Exorcist         252  Warner Brothers  $441.30   1973
Gone with the Wind   288              MGM  $402.40   1939
Bambi                540              RKO  $267.40   1942
The Godfather        604        Paramount  $245.10   1972
101 Dalmatians       708      Buena Vista  $215.90   1961
The Jungle Book      755      Buena Vista  $205.80   1967

In [30]:
after_1975 = movies["Year"] > 1975
movies[after_1975]

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[775 rows x 4 columns]

In [31]:
# We can also specify a range between which all values must fall.
between_80s = movies["Year"].between(1983, 1986)
movies[between_80s]

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

In [32]:
# We can also use the DataFrame index to filter rows.
has_dark_in_title = movies.index.str.lower().str.contains("dark")
movies[has_dark_in_title]

                                Rank           Studio       Gross  Year
Title
Transformers: Dark of the Moon    23        Paramount  $1,123.80   2011
The Dark Knight Rises             27  Warner Brothers  $1,084.90   2012
The Dark Knight                   39  Warner Brothers  $1,004.90   2008
Thor: The Dark World             132      Buena Vista    $644.60   2013
Star Trek Into Darkness          232        Paramount    $467.40   2013
Fifty Shades Darker              309        Universal    $381.50   2017
Dark Shadows                     600  Warner Brothers    $245.50   2012
Dark Phoenix                     603              Fox    $245.10   2019

In [44]:
has_world_in_title = movies.index.str.lower().str.contains("world")
movies[has_world_in_title]

                                                 Rank  ...  Year
Title                                                  ...
Jurassic World                                      6  ...  2015
Jurassic World: Fallen Kingdom                     13  ...  2018
Pirates of the Caribbean: At World's End           44  ...  2007
Thor: The Dark World                              132  ...  2013
The Lost World: Jurassic Park                     146  ...  1997
War of the Worlds                                 154  ...  2005
World War Z                                       183  ...  2013
How to Train Your Dragon: The Hidden World        199  ...  2019
The World Is Not Enough                           349  ...  1999
Waterworld                                        546  ...  1995
Master and Commander: The Far Side of the World   731  ...  2003

[11 rows x 4 columns]

##Grouping Data

Our next challenge is the most complex one yet. We might be curious which studio
had the highest total grosses across all films. Let’s aggregate the values in the Gross column by studio.

In [47]:
# replaces all occurrences of "$" and "," with empty text
movies["Gross"].str.replace("$", "", regex = False).str.replace(",", "", regex = False)

Title
Avengers: Endgame               2796.30
Avatar                          2789.70
Titanic                         2187.50
Star Wars: The Force Awakens    2068.20
Avengers: Infinity War          2048.40
                                  ...
Yogi Bear                        201.60
Garfield: The Movie              200.80
Cats & Dogs                      200.70
The Hunt for Red October         200.50
Valkyrie                         200.30
Name: Gross, Length: 782, dtype: object

In [48]:
# convert the Gross column’s values from text to floating- point numbers
(
    movies["Gross"]
    .str.replace("$", "", regex = False)
    .str.replace(",", "", regex = False)
    .astype(float)
)

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

In [49]:
# Now the transformation is permanent
movies["Gross"] = (
    movies["Gross"]
    .str.replace("$", "", regex = False)
    .str.replace(",", "", regex = False)
    .astype(float)
)

In [50]:
# calculates the average box-office gross of the movies
movies["Gross"].mean()

439.0308184143226

In [51]:
# group the DataFrame’s rows based on values in the Studio column
studios = movies.groupby("Studio")

In [52]:
# count the number of films per studio
studios["Gross"].count().head()

Studio
Artisan                     1
Buena Vista               125
CL                          1
China Film Corporation      1
Columbia                    5
Name: Gross, dtype: int64

In [53]:
# sort the Series by count of films, from most to least
studios["Gross"].count().sort_values(ascending = False).head()

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Name: Gross, dtype: int64

In [54]:
# sort the Series by count of films, from least to most
studios["Gross"].count().sort_values(ascending = True).head()

Studio
Artisan      1
Newmarket    1
RKO          1
Rela.        1
Magn.        1
Name: Gross, dtype: int64

In [55]:
# pull out their row’s respective Gross values, and sum them together
studios["Gross"].sum().head()

Studio
Artisan                     248.6
Buena Vista               73585.0
CL                          228.1
China Film Corporation      699.8
Columbia                   1276.6
Name: Gross, dtype: float64

In [56]:
# sort the Series values in descending order
studios["Gross"].sum().sort_values(ascending = False).head()

Studio
Buena Vista        73585.0
Warner Brothers    58643.8
Fox                50420.8
Universal          44302.3
Sony               32822.5
Name: Gross, dtype: float64